;*******************************************************************************************
;  FILE:   Psionics Ex Machina. int                                 
;  
;	File created	25/07/20    21:00
;	LAST UPDATED    18/01/21	17:50
;
;*******************************************************************************************

;========================================================
;   ADJUSTMENTS TO BASE GAME DESCRIPTIONS
;========================================================
[Psionics X2TechTemplate]
DisplayName="Psionics Ex Machina"
Summary="Although we've seen them wielding Psionic powers before, our recent encounters with the aliens have truly shown us how they are able to deftly manipulate the flow of Psionic energy and use it to their advantage. If we were to master it as well as they have, the potential applications in the field would be limitless. More experiments required."
CodeName="Cloista Geller"
LongDescription="By closely examining the aliens' own means of harnessing and wielding Psionic energy, I believe the chances are good that we'll have more than enough viable candidates to serve as Psi Operatives. However, with the advanced Psionic capabilities we've seen from the various alien species in the field, it may not be enough. In preparation for the new class of soldiers, I've used the chip removed from the Commander to study the technology needed to focus and divert Psionic energy. Combined with an inspection of the ADVENT Priest Psi Amps, I was able to reverse engineer schematics for XCOM.\nHowever, the XCOM Psi Amp proved lacking even in the hands of strong Psionic candidates.\nOver time, Meld from the invasion has crystallized and it's power become inert. It can be found in it's new form as what look like Gemstones. An old rusty facility study that we discovered found it is also fused to the bodies of long term residents, and can be harvested from them. I have called this new form the 'Gemlike Energised Meld'(GEM). It was a purely accidental discovery but the substance seems to react strongly to our Psi Amps, so this will be our new method of gaining Psionic powers. I also realized that the GEM is the perfect conduit for Psionic energy and could slot directly into our Psi Amps. Some of these GEMs would become highly unstable and require a further limiting framework. Thankfully embedding the GEM into a Personal Combat Stim and inserting directly into our soldiers minds is a good way to stabilize these powerful Psionic Powers.\nAlthough the potential for negative side effects will be high, I foresee the possibility that our soldiers will be able to push their new powers beyond the limits of what we might consider safe.\nR. Tygan."

[PsiAmp_CV X2WeaponTemplate]
FriendlyName="Basic Psi Amp"
FriendlyNamePlural="Basic Psi Amps"
BriefSummary="This version of the Psionic Amplifier channels the user's Psionic energy, enabling Psionic Offense in our operatives. More advanced Psi Amps can increase the Operative's Psionic strength, and the effectiveness of their abilities. A Psionic Amplifier offers little on it's own, allowing our Operatives to detonate minor explosives. They require additional GEMs to fully unlock the Operatives focus and potential."
TacticalText="<Bullet/> A Psi Amp allows Operatives to perform their Psionic abilities.\n<Bullet/> More advanced Psi Amps can increase the Operative's Psionic strength, and the effectiveness of their abilities.</br><Bullet> A Psionic Amplifier offers little on it's own, allowing our Operatives to detonate minor explosives. They require additional GEMs to fully unlock the Operatives focus and potential."
AbilityDescName="psi amp"

[PsiAmp_MG X2WeaponTemplate]
FriendlyName="Advanced Psi Amp"
FriendlyNamePlural="Advanced Psi Amps"
BriefSummary="This evolved version of the Psionic Amplifier channels the user's Psionic energy far more clearly, enabling greater Psionic Offense in our operatives. Psi Offense and Psionic attack damage of some abilities is improved when carrying this advanced amplifier.</br><Bullet> A Psionic Amplifier offers little on it's own, allowing our Operatives to detonate minor explosives. They require additional GEMs to fully unlock the Operatives focus and potential."
TacticalText="<Bullet/> The Advanced Psionic Amplifier increases an Operative's Psionic Offense by +20.\n<Bullet/> Psi Offense determines the potency of many of your psychic abilities.\n<Bullet/> The Advanced Psi Amp also increases the damage done by many Psionic attacks.</br><Bullet> A Psionic Amplifier offers little on it's own, allowing our Operatives to detonate minor explosives. They require additional GEMs to fully unlock the Operatives focus and potential."
AbilityDescName="psi amp"

[PsiAmp_BM X2WeaponTemplate]
FriendlyName="Alien Psi Amp"
FriendlyNamePlural="Alien Psi Amps"
BriefSummary="This evolved version of the Psionic Amplifier incorporates artifacts from the powerful \"Gatekeeper\" alien we encountered. It will put our experienced Operatives on the same level as the aliens' most powerful Psionic forces.</br><Bullet> A Psionic Amplifier offers little on it's own, allowing our Operatives to detonate minor explosives. They require additional GEMs to fully unlock the Operatives focus and potential.""
TacticalText="<Bullet/> This Alien Psionic Amplifier increases anOperative's Psionic Offense by +40.\n<Bullet/> Psi Offense determines the potency of many of your psychic abilities.<Bullet/> The Alien Psi Amp also increases the damage done by many Psionic attacks.</br><Bullet> A Psionic Amplifier offers little on it's own, allowing our Operatives to detonate minor explosives. They require additional GEMs to fully unlock the Operatives focus and potential."
AbilityDescName="psi amp"

[TargetDefinition X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by this <Ability:ClassName/> remains permanently visible."
LocHelpText="Any unit seen by this <Ability:ClassName/> remains permanently visible."
LocPromotionPopupText="<Bullet/> Scouting with this <Ability:ClassName/> will allow enemies to be tracked even if they enter the fog of war.<br/>"

[TargetDefinitionPassive X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by this <Ability:ClassName/> remains permanently visible."
LocHelpText="Any unit seen by this <Ability:ClassName/> remains permanently visible."

;========================================================
;   NEW ITEMS - PSI PCS AND GEMS
;========================================================

;PCS and GEMS now dynamically copy their attached ability texts

[InertMeld X2ItemTemplate]
FriendlyName="<font color = '#b6b3e3'>Crystallised MELD</font>"
FriendlyNamePlural="<font color = '#b6b3e3'>Crystallised MELD</font>"
BriefSummary="A lump of MELD in a crystallised, inert state. ADVENT forces appear to be instructed to recover samples whenever they find any.\nOur first sample was used as a paperweight within Dr.Tygans Lab."
TacticalText="A lump of MELD in a crystallised, inert state. ADVENT forces appear to be instructed to recover samples whenever they find any.\nOur first sample was used as a paperweight within Dr.Tygans Lab."
TinySummary="<font color = '#b6b3e3'>Crystallised MELD</font>"
LootTooltip="A lump of MELD in a crystallised, inert state."
;;Shows up in the resources bar with the below name
AbilityDescName = "<font color = '#b6b3e3'>MELD</font>"

;========================================================
;   NEW ABILITIES - FOR THE TESTING COMBAT INTELLIGENCE
;========================================================

;Used for errors in ability gifted by combat intelligence
[PexM_Error X2AbilityTemplate]
LocFriendlyName="<font color = '#6A1616'> ! ERROR ! </font>"
LocLongDescription="<font color = '#6A1616'> ! ERROR ! </font>\nYou should not be reading this. Contact Mod Author with description of BUG, launch.log's and screenshots.\n"<font color = '#6A1616'> ! ERROR ! </font>"
LocHelpText="<font color = '#6A1616'> ! ERROR ! </font>\nYou should not be reading this. Contact Mod Author with description of BUG, launch.log's and screenshots.\n"<font color = '#6A1616'> ! ERROR ! </font>"
LocPromotionPopupText="<font color = '#6A1616'> ! ERROR ! </font>\nYou should not be reading this. Contact Mod Author with description of BUG, launch.log's and screenshots.\n"<font color = '#6A1616'> ! ERROR ! </font>"
LootTooltip="<font color = '#6A1616'> ! ERROR ! </font>"
LocFlyOverText="<font color = '#6A1616'> ! ERROR ! </font>"

;Actually used for abilities that could not be converted
[PexM_Meld X2AbilityTemplate]
LocFriendlyName="Crystallised MELD"
LocLongDescription="A lump of MELD in a crystallised, inert state."
LocHelpText="A lump of MELD in a crystallised, inert state."
LocPromotionPopupText="A lump of MELD in a crystallised, inert state."
LootTooltip="A lump of MELD in a crystallised, inert state"
LocFlyOverText=""

;ACTIVE ABILITIES
[RapidPsionics_Standard X2AbilityTemplate]
LocFriendlyName="Clarity of Mind"
LocLongDescription="This <Ability:ClassName/> is trained to control their Psionic abilities. Gain a free use of a psionic skill and refund all psionic cooldowns, charges and costs. Mentally draining."
LocPromotionPopupText="This <Ability:ClassName/> has undergone extensive training to help them control their Psionic abilities. Through meditation they can clear their mind and refocus their Psionic abilities. Mentally draining."
LocHelpText="Refocus the unit's Psionic abilities. Next Psionic skill used is free. May drain will."
LocFlyOverText="Dios Ex"

[RapidPsionics_Average X2AbilityTemplate]
LocFriendlyName="Clarity of Mind"
LocLongDescription="This <Ability:ClassName/> is trained to control their Psionic abilities. Gain a free use of a psionic skill and refund all psionic cooldowns, charges and costs. Mentally draining."
LocPromotionPopupText="This <Ability:ClassName/> has undergone extensive training to help them control their Psionic abilities. Through meditation they can clear their mind and refocus their Psionic abilities. Mentally draining."
LocHelpText="Refocus the unit's Psionic abilities. Next Psionic skill used is free. May drain will."
LocFlyOverText="Dios Ex"

[RapidPsionics_Gifted X2AbilityTemplate]
LocFriendlyName="Clarity of Mind"
LocLongDescription="This <Ability:ClassName/> is trained to control their Psionic abilities. Gain a free use of a psionic skill and refund all psionic cooldowns, charges and costs. Mentally draining."
LocPromotionPopupText="This <Ability:ClassName/> has undergone extensive training to help them control their Psionic abilities. Through meditation they can clear their mind and refocus their Psionic abilities. Mentally draining."
LocHelpText="Refocus the unit's Psionic abilities. Next Psionic skill used is free. May drain will."
LocFlyOverText="Dios Ex"

[RapidPsionics_Genius X2AbilityTemplate]
LocFriendlyName="Clarity of Mind"
LocLongDescription="This <Ability:ClassName/> is trained to control their Psionic abilities. Gain a free use of a psionic skill and refund all psionic cooldowns, charges and costs. Mentally draining."
LocPromotionPopupText="This <Ability:ClassName/> has undergone extensive training to help them control their Psionic abilities. Through meditation they can clear their mind and refocus their Psionic abilities. Mentally draining."
LocHelpText="Refocus the unit's Psionic abilities. Next Psionic skill used is free. May drain will."
LocFlyOverText="Dios Ex"

[RapidPsionics_Savant X2AbilityTemplate]
LocFriendlyName="Clarity of Mind"
LocLongDescription="This <Ability:ClassName/> is trained to control their Psionic abilities. Gain a free use of a psionic skill and refund all psionic cooldowns, charges and costs. Mentally draining."
LocPromotionPopupText="This <Ability:ClassName/> has undergone extensive training to help them control their Psionic abilities. Through meditation they can clear their mind and refocus their Psionic abilities. Mentally draining."
LocHelpText="Refocus the unit's Psionic abilities. Next Psionic skill used is free. May drain will."
LocFlyOverText="Dios Ex"

;PASSIVE ABILITIES
[PexM_TestBoost_Standard X2AbilityTemplate]
LocFriendlyName="Psionic Grade I"
LocLongDescription="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. This boost comes in the form of being able to rapidly refocus their Psionic Potential."
LocPromotionPopupText="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. </br><Bullet> This boost comes in the form of being able to rapidly refocus their Psionic Potential."

[PexM_TestBoost_Average X2AbilityTemplate]
LocFriendlyName="Psionic Grade II"
LocLongDescription="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. This boost comes in the form of being able to rapidly refocus their Psionic Potential."
LocPromotionPopupText="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. </br><Bullet> This boost comes in the form of being able to rapidly refocus their Psionic Potential."

[PexM_TestBoost_Gifted X2AbilityTemplate]
LocFriendlyName="Psionic Grade III"
LocLongDescription="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. This boost comes in the form of being able to rapidly refocus their Psionic Potential."
LocPromotionPopupText="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. </br><Bullet> This boost comes in the form of being able to rapidly refocus their Psionic Potential."

[PexM_TestBoost_Genius X2AbilityTemplate]
LocFriendlyName="Psionic Grade IV"
LocLongDescription="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. This boost comes in the form of being able to rapidly refocus their Psionic Potential."
LocPromotionPopupText="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. </br><Bullet> This boost comes in the form of being able to rapidly refocus their Psionic Potential."

[PexM_TestBoost_Savant X2AbilityTemplate]
LocFriendlyName="Psionic Grade V"
LocLongDescription="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. This boost comes in the form of being able to rapidly refocus their Psionic Potential."
LocPromotionPopupText="This <Ability:ClassName/> has passed through Psi testing and has unlocked their inner Psionic Power, recieving a boost to Psi Offense. </br><Bullet> This boost comes in the form of being able to rapidly refocus their Psionic Potential."

;========================================================
;   NEW TECHS
;========================================================

;New PG Techs
[Tech_PexM_PCS X2TechTemplate]
DisplayName="Experimental Psionics: PCS"
Summary="Working with an alien crystalline substance from the invasion we have discovered it can be used as a conduit for Psionic Energies. We can try to activate the dormant properties of the Gemlike Energised Meld, or GEM. Some of these GEMs become highly unstable, however by embedding them within a Personal Combat Stim frame we can create a stable Psionic Combat Stim. Although I cannot predict what exactly will come of it - Tygan"

[Tech_PexM_GEMS X2TechTemplate]
DisplayName="Experimental Psionics: GEM"
Summary="Working with an alien crystalline substance from the invasion we have discovered it can be used as a conduit for Psionic Energies. We can try to activate the dormant properties of the Gemlike Energised Meld, or GEM. Although I cannot predict what exactly will come of it - Tygan"

[Tech_PexM_CONVERT X2TechTemplate]
DisplayName="Experimental Psionics: Crystallized MELD Extraction"
Summary="Commander, I think we have discovered the real reason ADVENT are sending Extermination Squads into the abandoned cities. It looks like they are harvesting the Crystallized MELD that has been fused into the bodies of residents and beings that have spent significant time around the Invasion Pods. If you can collect enough corpses, we should be able to harvest some for our own use. - Tygan"

;========================================================
;   NEW FACILITY STUFFS - SEE ALSO MOD.INT
;========================================================

[PexMChamber X2FacilityTemplate]
DisplayName="Experimental Psi"
CompletedSummary="We now have a facility dedicated to the production of Psionic Components.\nNew Staff Slots Available - Experimental Psionics"
Summary="This Psi Lab will allow you to create powerful Psionic Equipment. Our soldiers can supplement standard soldier training with an intense mental ordeal that will fine tune their control of Psionics.

[PexMChamber_SecondCell X2FacilityUpgradeTemplate]
DisplayName="Convergent Workspace"
FacilityName="Experimental Psi"
Summary="Add another area to Experimental Psionics, allowing an additional space for staff to concentrate on crafting Psionic Equipment"

[PexMChamber_TrainingCell X2FacilityUpgradeTemplate]
DisplayName="Gollop Psionics"
FacilityName="Experimental Psi"
Summary="Add another area to Experimental Psionics, allowing an additional space for soldiers to test their Psionic Potential and gain a boost to Psionic Offense matching their innate intelligence, may allow them to also equip any unique Psionic Weapons we develop."

[PexMChamberStaffSlot_Sci X2StaffSlotTemplate]
EmptyText="OPEN: SCIENTIST REQUIRED"
BonusEmptyText="Decreases Build Time."
BonusText="BUILD TIME -%AVENGERBONUS%"
FilledText="%UNITNAME's Psionic engineering knowledge is increasing the rate we produce Psionic projects!"
LockedText="LOCKED: PURCHASE UPGRADE"

[PexMChamberStaffSlot_Eng X2StaffSlotTemplate]
EmptyText="OPEN: ENGINEER REQUIRED"
BonusEmptyText="Decreases Build Time."
BonusText="BUILD TIME -%AVENGERBONUS%"
FilledText="%UNITNAME's Psionic engineering knowledge is increasing the rate we produce Psionic projects!"
LockedText="LOCKED: PURCHASE UPGRADE"

[PexMChamberStaffSlot_Sol X2StaffSlotTemplate]
EmptyText="OPEN: SOLDIER REQUIRED"
BonusEmptyText="TRAINING: PSIONICS"
BonusText="TRAINING: PSIONICS"
FilledText="%UNITNAME's is undergoing intense Psionic training."
LockedText="LOCKED: PURCHASE UPGRADE"

;========================================================
;   NEW BREAKTHROUGH TECHS
;========================================================

[BreakthroughPsiAmpWeaponUpgrade X2TechTemplate]
DisplayName="Modular Psionic Amplifiers"
Summary="A redesigned frame system for our Psionic Amplifiers has allowed us to insert an additional GEM upgrade slot."

[BreakthroughPexMChamberCostReduction X2TechTemplate]
DisplayName="Psionics Construction"
Summary="Improvements to our containment of unbound Psionic energy will now reduce the cost of constructing the Psionics Laboratory by %VALUE%."

[BreakthroughPexMChamberSecondCellCostReduction X2TechTemplate]
DisplayName="Convergent Workspace Construction"
Summary="With dedicated time and equipment we can clear the rear zone of the Psionics Laboratory at a reduced cost by %VALUE%."

[BreakthroughPexMChamberTrainingCellCostReduction X2TechTemplate]
DisplayName="Gollop Psionics Construction"
Summary="With dedicated time and equipment we can clear the side zone of the Psionics Laboratory at a reduced cost by %VALUE%."

;========================================================
;   NEW OTHER STUFF 
;========================================================

[XComGame.UIInventory_PexM]
[UIInventory_PexM]
m_strTitleBig=PSIONICS STORAGE
m_strNoLoot=NO PSIONICS AVAILABLE
m_strBuy=

;changing the name in case of Psionics Overhaul v3 integration by allowing the psi lab ?!?
[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_PsiAmp]=PSIONICS

;========================================================
;   - ENCYLOPEDIA -
;========================================================

;XcomEnclopedia.ini
;+-EncyclopediaNames    // [thispart X2EncyclopediaTemplate]
;ListCategory;		    // Internal name of the category to which this header/entry belong to
;bCategoryHeader;	    // If true, this entry functions as a category header; if false, this entry functions as a regular entry.
;SortingPriority;	    // The priority of this entry relative to others in the same category (lower priority sorts higher in the list).
;Requirements;		    // Requirements to show up in the archive
;ListImagePath;		    // The URL to the image that should be displayed as part of the list entry if this is a header.
;DescriptionImagePath;  // The URL to the image that should be displayed as part of the list entry if this is not a header.

;this file
;ListTitle;			 // Player facing name of this entry/header.
;DescriptionTitle;   // Player facing description title that appears when selected.
;DescriptionEntry;   // Player facing description body that appears when selected.

[Header_FACILITYDATA X2EncyclopediaTemplate]
[PexMChamber_Facility X2EncyclopediaTemplate]
ListTitle="Experimental Psionics"
DescriptionTitle="Experimental Psionics"
DescriptionEntry="Provides access to Psionic testing for XCOM operatives. This Psi Lab will allow you to create powerful Psionic Equipment. Our soldiers can substitute standard soldier training with the intense mental ordeal that will unlock their latent Psionic talents.\n\nAlthough we've seen them wielding Psionic powers before, our recent encounters with the aliens have truly shown us how they are able to deftly manipulate the flow of Psionic energy and use it to their advantage. If we were to master it as well as they have, the potential applications in the field would be limitless. More experiments required."

[Header_PEXM X2EncyclopediaTemplate]
ListTitle="EXPERIMENTAL PSIONICS"

[InertMeld X2EncyclopediaTemplate]
ListTitle="<font color = '#b6b3e3'>Crystallised MELD</font>"
DescriptionTitle="<font color = '#b6b3e3'>Crystallised MELD</font>"
DescriptionEntry="A lump of Meld in a crystallised, inert state. ADVENT forces appear to be instructed to recover samples whenever they find any.\nOur first sample was used as a paperweight within Dr.Tygans Lab."

[PexMChamber X2EncyclopediaTemplate]
ListTitle="Experimental Psionics"
DescriptionTitle="Experimental Psionics"
DescriptionEntry="Provides access to Psionic testing for XCOM operatives. This Psi Lab will allow you to create powerful Psionic Equipment. Our soldiers can substitute standard soldier training with the intense mental ordeal that will unlock their latent Psionic talents.\n\nAlthough we've seen them wielding Psionic powers before, our recent encounters with the aliens have truly shown us how they are able to deftly manipulate the flow of Psionic energy and use it to their advantage. If we were to master it as well as they have, the potential applications in the field would be limitless. More experiments required."
